
#追涨杀跌交易法
#http://blog.fens.me/finance-chase-sell/

#可以上涨中段追入买进，在大幅下跌之前卖出，就是追涨杀跌法。

#追涨：
#1、短线追涨：当天股价已经涨了5个点或更多，这时追进去买入，期待当天收盘涨停，
#等下一个交易日高价卖出，这就是短线追涨。
#2、中线追涨：某只股票的股价已经上涨了一段时间，走势很强，底部上涨已经有30%或更多，
#这个时追进去买入，期待后势持续上涨，是中线追涨。

#1、对于短线追涨策略可以简单粗暴地选择当日涨幅超过5%的股票进行买入，第二日开盘卖出或到止损位卖出，
#并没有太多的技术细节，再计算一下胜率概率，就能知道我们要不要短线追涨。

#2、追涨杀跌的建型和实现（以中线追涨为例）

#策略：
#当股价(成交量)向上突破最近20日最高价格(量)时买入，当股价向下突破最近10日最低价格卖出，
#并以沪深300成分股做为股票交易的标的。
#选择沪深300成分股为标的，是考虑到这些股票都是各个板块的强势股或龙头股，要符合追涨杀跌的假设条件。

#计算公式：
#20日最高价 = max(T日股价,T-1日股价 ... , T-19日股价)
#20日最高量 = max(T日成交量,T-1日成交量 ... , T-19日成交量)
#10日最低价 = min(T日股价,T-1日股价 ... , T-9日股价)

#当股价大于等于20日最高价时作为买入信号点，当股价小于等于10日最低价时作为卖出信号点。


#1)数据准备
# R提供了丰富的金融函数工具包，时间序列包zoo和xts，指标计算包TTR，数据处理包plyr，可视包ggplot2
# 也可以用quantmod包从Yahoo财经下载数据。
# 
# 数据，包括A股日K线(向前复权)数据，从2014年7月到2015年日8月，以CSV格式保存到本地文件stock.csv。
# 按股票代码分组，生成R语言的list对象，同时把每支股票的data.frame类型对象转成XTS时间序列类型对象

#加载工具包
library(plyr)
library(xts)
library(TTR)
library(ggplot2)
library(scales)

# 读取CSV数据文件
read<-function(file){ 
     df<-read.table(file=file,header=FALSE,sep = ",", na.strings = "NULL") # 读文件
     
#      df
#               V1         V2    V3    V4    V5    V6       V7
#      1 000001.SZ 2014-07-02  8.14  8.18  8.10  8.17 28604171
#      2 000002.SZ 2014-07-02  8.09  8.13  8.05  8.12 40633122
#      3 000004.SZ 2014-07-02 13.90 13.99 13.82 13.95  1081139
     
     
     names(df)<-c("code","date","Open","High","Low","Close","Volume")      # 设置列名
     dl<-split(df[-1],df$code)                                             # 按code分组
     
#      > dl
#      $`000001.SZ`
#      date Open High Low Close   Volume
#      1 2014-07-02 8.14 8.18 8.1  8.17 28604171
#      
#      $`000002.SZ`
#      date Open High  Low Close   Volume
#      2 2014-07-02 8.09 8.13 8.05  8.12 40633122
#      
#      $`000004.SZ`
#      date Open  High   Low Close  Volume
#      3 2014-07-02 13.9 13.99 13.82 13.95 1081139
#      
#      $`000005.SZ`
#      date Open High  Low Close  Volume
#      4 2014-07-02 2.27 2.29 2.26  2.28 4157537
#      
#      $`000006.SZ`
#      date Open High Low Close  Volume
#      5 2014-07-02 4.57 4.57 4.5  4.55 5137384
#      
#      $`000010.SZ`
#      date Open High Low Close  Volume
#      6 2014-07-02  6.6 6.82 6.5  6.73 9909143
     
     
     lapply(dl,function(row){                                              # 换成xts类型数据
         xts(row[-1],order.by = as.Date(row$date))
       })
   }

# 加载数据
data<-read("C:\\Users\\cyw\\Documents\\GitHub\\Rcoder\\qutke_code\\stock.csv")

# 查看数据类型
class(data)
 # "list"

# 查看数据的索引值
 head(names(data))
# "000001.SZ" "000002.SZ" "000004.SZ" "000005.SZ" "000006.SZ" "000007.SZ"

# 查看包括的股票数量
length(data)
# [1] 2782

# 查看股票000001.SZ
head(data[['000001.SZ']])
# Open     High      Low    Close   Volume
# 2014-07-02 8.146949 8.180000 8.105636 8.171737 28604171
# 2014-07-03 8.171737 8.254364 8.122162 8.229576 44690486
# 2014-07-04 8.237838 8.270889 8.146949 8.188263 34231126
# 2014-07-07 8.188263 8.204788 8.097374 8.146949 34306164
# 2014-07-08 8.130424 8.204788 8.072586 8.204788 34608702
# 2014-07-09 8.196525 8.196525 7.915596 7.973434 58789114


#2、模型建立
# 日K线数据
title<-'300104.SZ'
stock<-data[[title]]                                # 获得股票数据
sDate<-as.Date("2015-01-01")                        # 开始日期
eDate<-as.Date("2015-08-24")                        # 结束日期
cdata<-stock[dateArea(sDate,eDate,360)]$Close       # 获得收盘价
vdata<-stock[dateArea(sDate,eDate,360)]$Volume      # 获得交易量


# 收盘价
names(cdata)<-"Value"   # 重置列名
tail(cdata)
#             Value
# 2015-08-14 49.81
# 2015-08-17 48.30
# 2015-08-18 45.57
# 2015-08-19 46.98
# 2015-08-20 45.79
# 2015-08-21 42.14

# 交易量
tail(vdata)
#             Volume
# 2015-08-14 42108324
# 2015-08-17 35939096
# 2015-08-18 52745702
# 2015-08-19 43447844
# 2015-08-20 32916746
# 2015-08-21 34802494

# 画图函数
drawLine<-function(cdata,titie="Stock",sDate=min(index(cdata)),eDate=max(index(cdata)),breaks="1 year"){
       if(sDatemax(index(cdata))) eDate=max(index(cdata))  
       cdata<-na.omit(cdata)
       
         g<-ggplot(aes(x=Index, y=Value),data=fortify(cdata[,1],melt=TRUE))
         g<-g+geom_line()
         
           if(ncol(cdata)>1){ # 多条线
                 g<-g+geom_line(aes(colour=Series),data=fortify(cdata[,-1],melt=TRUE))  
             }
         
           g<-g+scale_x_date(labels=date_format("%Y-%m"),breaks=date_breaks(breaks),limits = c(sDate,eDate))
           g<-g+ylim(min(cdata$Value), max(cdata$Value))
           g<-g+xlab("") + ylab("Price")+ggtitle(title)
           g
       }

# 画出收盘价
# drawLine(cdata,title,sDate,eDate,'1 month')    # 画图

# 计算最近20日的最高价和10日的最低价
minmax<-function(data,max=20,min=10){
     d1<-na.locf(data,fromLast=TRUE)
     d2<-merge(d1,min=runMin(d1,min),max=runMax(d1,max))
     return(d2[,-1])
   }

# 画出股价，最高价和最低价
ldata<-cbind(cdata,minmax(cdata))
drawLine(ldata,title,sDate,eDate,'1 month')    # 画图


# 计算买入信号，当股价向上突破最近20日最高价格时买入。
# 买入信号函数
buyPoint<-function(ldata){   
    idx<-which(ldata$Value == ldata$max)
    return(ldata[idx,])                                  
   }

# 计算买入的点
buydata<-buyPoint(ldata)
# buydata
#             Value      min      max
# 2015-01-08 17.43721 13.70164 17.43721
# 2015-01-09 17.98709 13.74254 17.98709
# 2015-01-12 19.53222 13.74254 19.53222
# 2015-01-15 20.21389 14.74232 20.21389
# 2015-01-16 22.23619 16.08749 22.23619
# 2015-01-19 23.04056 16.36016 23.04056
# 2015-01-20 23.89947 16.36016 23.89947
# 2015-01-26 24.77656 19.22774 24.77656
# 2015-01-27 25.16284 19.40043 25.16284
# 2015-02-05 26.91247 21.99533 26.91247
# 2015-02-10 28.68482 21.99533 28.68482
# 2015-02-11 31.55239 21.99533 31.55239
# 2015-02-12 31.87960 21.99533 31.87960
# 2015-02-13 35.06983 22.72245 35.06983
# 2015-02-16 38.57817 24.22213 38.57817
# 2015-02-17 40.99130 24.46753 40.99130
# 2015-03-16 41.07764 34.32453 41.07764
# 2015-03-18 41.94564 34.32453 41.94564
# 2015-03-24 45.34946 37.17393 45.34946
# 2015-04-23 46.27199 37.06031 46.27199
# 2015-04-24 50.89829 37.06031 50.89829
# 2015-04-27 50.90283 37.06031 50.90283
# 2015-04-28 55.44277 37.06031 55.44277
# 2015-04-29 60.98705 37.06031 60.98705
# 2015-05-06 62.25497 45.19495 62.25497
# 2015-05-07 66.20413 46.27199 66.20413
# 2015-05-08 67.23573 50.89829 67.23573
# 2015-05-11 73.96157 50.90283 73.96157
# 2015-05-12 81.36000 55.44277 81.36000
# 2015-05-13 82.49000 57.16514 82.49000



# 画图函数
drawPoint<-function(ldata,pdata,titie,sDate,eDate,breaks="1 year"){
       ldata<-na.omit(ldata)
       g<-ggplot(aes(x=Index, y=Value),data=fortify(ldata[,1],melt=TRUE))
       g<-g+geom_line()
       g<-g+geom_line(aes(colour=Series),data=fortify(ldata[,-1],melt=TRUE))
       
         if(is.data.frame(pdata)){
               g<-g+geom_point(aes(x=Index,y=Value,colour=op),data=pdata,size=4)
           }else{
                 g<-g+geom_point(aes(x=Index,y=Value,colour=Series),data=na.omit(fortify(pdata,melt=TRUE)),size=4)  
             }
       g<-g+scale_x_date(labels=date_format("%Y-%m"),breaks=date_breaks(breaks),limits = c(sDate,eDate))
       g<-g+xlab("") + ylab("Price")+ggtitle(title)
       g
   }

drawPoint(ldata,buydata$Value,title,sDate,eDate,'1 month')  # 画图


# 计算卖出信号点，当股价小于等于最近10日最低价时作为卖出信号点。
# 计算卖出的信号点
stopPoint<-function(ldata,buydata){  
       idx<-which(ldata$Value == ldata$min)
       idx<-idx[which(c(0,diff(idx))!=1)]   # 第一点用0表示
       
         selldata<-ldata[idx,]               # 所有低于最小值的点  
         idx2<-sapply(index(buydata),function(e){  # 买后的卖点
               head(which(index(selldata)>e),1)
           })
         
           return(selldata[unique(idx2),])
     } 

# 卖出信号
selldata<-stopPoint(ldata,buydata)
selldata
#             Value      min      max
# 2015-01-30 21.99533 21.99533 25.16284
# 2015-03-06 34.32453 34.32453 40.99130
# 2015-04-08 38.01011 38.01011 45.34946
# 2015-05-28 64.68000 64.68000 82.49000


# 买卖信号，画图
bsdata<-merge(buydata$Value,selldata$Value)
names(bsdata)<-c("buy","sell")
drawPoint(ldata,bsdata,title,sDate,eDate,'1 month') #画图

# 合并交易信号
signal<-function(buy, sell){
       selldf<-data.frame(sell,op=as.character(rep("S",nrow(sell))))
       buydf<-data.frame(buy,op=as.character(rep("B",nrow(buy))))
       sdata<-rbind(buydf,selldf)                                       # 交易信号数据
       sdata[order(as.Date(row.names(sdata))),]
   }

# 合并交易信号
sdata<-signal(buydata,selldata)                                   
sdata
#               Value      min      max op
# 2015-01-08 17.43721 13.70164 17.43721  B
# 2015-01-09 17.98709 13.74254 17.98709  B
# 2015-01-12 19.53222 13.74254 19.53222  B
# 2015-01-15 20.21389 14.74232 20.21389  B
# 2015-01-16 22.23619 16.08749 22.23619  B
# 2015-01-19 23.04056 16.36016 23.04056  B
# 2015-01-20 23.89947 16.36016 23.89947  B
# 2015-01-26 24.77656 19.22774 24.77656  B
# 2015-01-27 25.16284 19.40043 25.16284  B
# 2015-01-30 21.99533 21.99533 25.16284  S
# 2015-02-05 26.91247 21.99533 26.91247  B
# 2015-02-10 28.68482 21.99533 28.68482  B
# 2015-02-11 31.55239 21.99533 31.55239  B
# 2015-02-12 31.87960 21.99533 31.87960  B
# 2015-02-13 35.06983 22.72245 35.06983  B
# 2015-02-16 38.57817 24.22213 38.57817  B
# 2015-02-17 40.99130 24.46753 40.99130  B
# 2015-03-06 34.32453 34.32453 40.99130  S
# 2015-03-16 41.07764 34.32453 41.07764  B
# 2015-03-18 41.94564 34.32453 41.94564  B
# 2015-03-24 45.34946 37.17393 45.34946  B
# 2015-04-08 38.01011 38.01011 45.34946  S
# 2015-04-23 46.27199 37.06031 46.27199  B
# 2015-04-24 50.89829 37.06031 50.89829  B
# 2015-04-27 50.90283 37.06031 50.90283  B
# 2015-04-28 55.44277 37.06031 55.44277  B
# 2015-04-29 60.98705 37.06031 60.98705  B
# 2015-05-06 62.25497 45.19495 62.25497  B
# 2015-05-07 66.20413 46.27199 66.20413  B
# 2015-05-08 67.23573 50.89829 67.23573  B
# 2015-05-11 73.96157 50.90283 73.96157  B
# 2015-05-12 81.36000 55.44277 81.36000  B
# 2015-05-13 82.49000 57.16514 82.49000  B
# 2015-05-28 64.68000 64.68000 82.49000  S


# 模拟交易。我们设定交易参数和规则：
# 
# 以10万元人民币为本金。
# 买入信号出现时，以收盘价买入，每次买入价值1万元的股票。如果连续出现买入信号，则一直买入。若现金不足1万元时，则跳过买入信号。
# 卖出信号出现时，以收盘价卖出，一次性平仓信号对应的股票。
# 手续费为0元

# 模拟交易
trade<-function(sdata,capital=100000,fixMoney=10000){ # 交易信号，总资金，每次定投资金
       amount<-0
       cash<-capital
       
         ticks<-data.frame()
         for(i in 1:nrow(sdata)){
               row<-sdata[i,]
               if(row$op=='B'){
                     if(cash<fixMoney){
                           print(paste(row.names(row),"No enough cash"))
                           next
                       }
                     amount0<-floor(fixMoney/row$Value) # 本次交易量
                     amount<-amount+amount0
                     cash<-cash-amount0*row$Value
                 }
               
                 if(row$op=='S'){
                       cash<-cash+amount*row$Value
                       amount<-0
                   }
               
                 row$cash<-round(cash,2)
                 row$amount<-amount
                 row$asset<-round(cash+amount*row$Value,2)
                 ticks<-rbind(ticks,row)
            }
         
           
           ticks$diff<-c(0,round(diff(ticks$asset),2))
           
             rise<-ticks[intersect(which(ticks$diff>0),which(ticks$op=='S')),]   # 赚钱的交易
             fall<-ticks[intersect(which(ticks$diff<0),which(ticks$op=='S')),]   # 赔钱的交易
             
               return(list(
                     ticks=ticks,
                     rise=rise,
                     fall=fall
                 ))
         }

# 交易结果
result<-trade(sdata,100000,10000)  

result$ticks
#               Value      min      max op      cash amount    asset      diff
# 2015-01-08 17.43721 13.70164 17.43721  B  90008.48    573 100000.0      0.00
# 2015-01-09 17.98709 13.74254 17.98709  B  80025.65   1128 100315.1    315.08
# 2015-01-12 19.53222 13.74254 19.53222  B  70044.68   1639 102058.0   1742.91
# 2015-01-15 20.21389 14.74232 20.21389  B  60059.02   2133 103175.2   1117.26
# 2015-01-16 22.23619 16.08749 22.23619  B  50074.97   2582 107488.8   4313.56
# 2015-01-19 23.04056 16.36016 23.04056  B  40075.37   3016 109565.7   2076.90
# 2015-01-20 23.89947 16.36016 23.89947  B  30085.39   3434 112156.2   2590.46
# 2015-01-26 24.77656 19.22774 24.77656  B  20100.44   3837 115168.1   3011.92
# 2015-01-27 25.16284 19.40043 25.16284  B  10110.79   4234 116650.2   1482.16
# 2015-01-30 21.99533 21.99533 25.16284  S 103239.02      0 103239.0 -13411.23
# 2015-02-05 26.91247 21.99533 26.91247  B  93254.49    371 103239.0      0.00
# 2015-02-10 28.68482 21.99533 28.68482  B  83272.17    719 103896.6    657.54
# 2015-02-11 31.55239 21.99533 31.55239  B  73301.62   1035 105958.3   2061.78
# 2015-02-12 31.87960 21.99533 31.87960  B  63323.30   1348 106297.0    338.66
# 2015-02-13 35.06983 22.72245 35.06983  B  53328.40   1633 110597.4   4300.43
# 2015-02-16 38.57817 24.22213 38.57817  B  43336.66   1892 116326.6   5729.13
# 2015-02-17 40.99130 24.46753 40.99130  B  33375.77   2135 120892.2   4565.63
# 2015-03-06 34.32453 34.32453 40.99130  S 106658.65      0 106658.6 -14233.54
# 2015-03-16 41.07764 34.32453 41.07764  B  96676.78    243 106658.6      0.00
# 2015-03-18 41.94564 34.32453 41.94564  B  86693.72    481 106869.6    210.92
# 2015-03-24 45.34946 37.17393 45.34946  B  76716.83    701 108506.8   1637.24
# 2015-04-08 38.01011 38.01011 45.34946  S 103361.92      0 103361.9  -5144.89
# 2015-04-23 46.27199 37.06031 46.27199  B  93367.17    216 103361.9      0.00
# 2015-04-24 50.89829 37.06031 50.89829  B  83391.11    412 104361.2    999.28
# 2015-04-27 50.90283 37.06031 50.90283  B  73414.15    608 104363.1      1.87
# 2015-04-28 55.44277 37.06031 55.44277  B  63434.45    788 107123.4   2760.29
# 2015-04-29 60.98705 37.06031 60.98705  B  53493.56    951 111492.2   4368.89
# 2015-05-06 62.25497 45.19495 62.25497  B  43532.77   1111 112698.0   1205.79
# 2015-05-07 66.20413 46.27199 66.20413  B  33535.95   1262 117085.6   4387.51
# 2015-05-08 67.23573 50.89829 67.23573  B  23585.06   1410 118387.4   1301.88
# 2015-05-11 73.96157 50.90283 73.96157  B  13600.25   1545 127870.9   9483.44
# 2015-05-12 81.36000 55.44277 81.36000  B   3674.33   1667 139301.5  11430.58
# 2015-05-28 64.68000 64.68000 82.49000  S 111495.89      0 111495.9 -27805.56

# 3、模型优化
# 优化策略：当股价低于前一个买入点价格的时进行卖出，把小于等于最近10日最低价设为止损点。

# 优化条件，当股价低于前一个买入点价格时进行卖出，小于10日最低价为止损点。
 # 计算卖出的信号点
sellPoint<-function(ldata,buydata){
         
           arr<-c()
           for(i in 1:nrow(buydata)){
                 
                   if(i>1){ # 跳转第一个点
                         date<-index(buydata[i,])#;print(date)      
                         
                          # 价格 小于 上一次的买入的价格就卖出
                           last<-as.vector(buydata[i-1,]$Value) # 上一次买入的价格
                           lst<-ldata[paste(date,"/",sep="")]$Value      
                           idx<-head(which(lst < last),1)
                           
                             if(length(idx)>0){        
                                   arr<-rbind(arr,index(lst[idx]))
                               }
                       }
             }
           selldata<-ldata[as.Date(unique(arr)),]
           
             # 过滤多余的卖出点
             bsdata<-merge(buydata$Value,selldata$Value)
             names(bsdata)<-c("buy","Value")
             idx1<-which(!is.na(bsdata$Value))
             idx2<-idx1[which(c(0,diff(idx1))==1)]
             bsdata$Value[idx2]<-NA
             return(bsdata$Value[which(!is.na(bsdata$Value))])
             
           }

# 卖出信号
selldata<-sellPoint(ldata,buydata)
selldata
#             Value
# 2015-01-21 22.81788
# 2015-01-28 23.60408
# 2015-02-25 36.89217
# 2015-03-17 39.97333
# 2015-03-19 40.96858
# 2015-03-26 39.25985
# 2015-05-14 74.24000

sdata<-signal(buydata$Value,selldata$Value)                                   # 合并交易信号
sdata
              # Value op
# 2015-01-08 17.43721  B
# 2015-01-09 17.98709  B
# 2015-01-12 19.53222  B
# 2015-01-15 20.21389  B
# 2015-01-16 22.23619  B
# 2015-01-19 23.04056  B
# 2015-01-20 23.89947  B
# 2015-01-21 22.81788  S
# 2015-01-26 24.77656  B
# 2015-01-27 25.16284  B
# 2015-01-28 23.60408  S
# 2015-02-05 26.91247  B
# 2015-02-10 28.68482  B
# 2015-02-11 31.55239  B
# 2015-02-12 31.87960  B
# 2015-02-13 35.06983  B
# 2015-02-16 38.57817  B
# 2015-02-17 40.99130  B
# 2015-02-25 36.89217  S
# 2015-03-16 41.07764  B
# 2015-03-17 39.97333  S
# 2015-03-18 41.94564  B
# 2015-03-19 40.96858  S
# 2015-03-24 45.34946  B
# 2015-03-26 39.25985  S
# 2015-04-23 46.27199  B
# 2015-04-24 50.89829  B
# 2015-04-27 50.90283  B
# 2015-04-28 55.44277  B
# 2015-04-29 60.98705  B
# 2015-05-06 62.25497  B
# 2015-05-07 66.20413  B
# 2015-05-08 67.23573  B
# 2015-05-11 73.96157  B
# 2015-05-12 81.36000  B
# 2015-05-13 82.49000  B
# 2015-05-14 74.24000  S



# 止损信号
stopdata<-stopPoint(ldata,buydata)

# 合并买卖信号，止损信号
bsdata<-merge(buydata$Value,selldata$Value,stopdata$Value)
names(bsdata)<-c("buy","sell","stop")
drawPoint(ldata,bsdata,title,sDate,eDate,'1 month') #画图






